Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/enforcement_of_judgments.html.txt.tmx
Source language: en
Languages: ga

source: • After the order is made
ga: • Tar éis ordú a dhéanamh

source: If you owe money to someone else, then you are a debtor and the other person is a creditor
ga: Is féichiúnaí tú má tá airgead ag duine éigin ort agus is creidiúnaí an duine (nó and comhlacht) a bhfuil airgead aige ort

source: If you fail to pay a debt, your creditor can go to court to get a judgment that you owe the debt
ga: Muna íocann tú fiach, is féidir leis an gcreidiúnaí dul go dtí an chúirt chun breithiúnas a fháil i do choinne

source: Getting a judgment means that the creditor is now entitled to use various mechanisms to get the money from you
ga: Is éard is brí le breithiúnas a fháil ná go bhfuil an creidiúnaí i dteideal anois úsáid a bhaint as meicníochtaí éagsúla chun an t-airgead a fháil uait

source: This is known as enforcing a judgment – the legal term is execution of the judgment
ga: Tugtar breithiúnas a fhorfheidhmiú air seo – is é an téarma dlíthiúil ná forghníomhú an bhreithiúnais

source: There are several different ways of enforcing a judgment
ga: Tá roinnt bealaí éagsúla chun breithiúnas a fhorfheidhmiú

source: The creditor chooses the means and can use several different means at the same time
ga: Roghnaíonn an creidiúnaí na modhanna agus is féidir leis modhanna éagsúla a úsáid ag an am céanna

source: The Civil Debt (Procedures) Act 2015 provides for changes in how debts can be enforced
ga: Athróidh an t Acht um Fhiachas Sibhialta (Nósanna Imeachta), 2015 an tAcht 2015 na cleachtais maidir le forfheidhmiú fhiachas sibhialta

source: It is due to come into effect shortly
ga: Tá sé le teacht i bhfeidhm go luath

source: After the order is made
ga: Tar éis ordú a dhéanamh

source: In general, once the creditor has a judgment order, the judgment can be enforced
ga: Go ginearálta, nuair atá ordú breithiúnais ag an gcreidiúnaí, is féidir an breithiúnas a chur i bhfeidhm

source: Enforcement orders can be issued by court offices – the creditor does not have to go back to court for the order
ga: Is féidir orduithe forfheidhmithe a bheith eisithe ag oifigí cúirte – ní chaithfidh an creidiúnaí dul ar ais chun na cúirte le haghaidh an ordaithe

source: Creditors have 12 years from the date of the judgment to look for enforcement orders
ga: Tá 12 bliain ag creidiúnaithe ó dháta an bhreithiúnais chun orduithe forghníomhaithe a lorg

source: However, if the judgment order was issued 6 or more years earlier, the creditor may have to apply to court for leave to issue execution
ga: Mar sin féin, má dheonaíodh an t-ordú breithiúnais sé nó níos mó de bhlianta roimhe sin, seans go mbeidh ar an gcreidiúnaí iarratas a dhéanamh ar an gcúirt le 'cead chun forghníomhú a eisiúint' a fháil

source: Once issued, enforcement orders are generally valid for a year and may then be renewed
ga: Nuair a eisítear iad, tá orduithe forghníomhaithe bailí, go ginearálta, ar feadh bliana agus féadfar athnuachán a dhéanamh orthu ansin

source: The courts can grant a stay of execution
ga: Is féidir leis na cúirteanna bac ar fhorghníomhú a bhronnadh

source: This means that the enforcement of the debt is halted for a period
ga: Is éard is brí leis seo ná go gcuirtear stop le forfheidhmiú an fhéich ar feadh tréimhse

source: A stay of execution may be granted, for example, if you can show that your inability to pay is not your fault
ga: Is féidir bac ar fhorghníomhú a bhronnadh más féidir leat a thaispeáint nach bhfuil locht d’éagumais íocaíochta ort, mar shampla

source: You cannot get a stay of execution if you have not engaged with the proceedings
ga: Ní féidir leat bac ar fhorghníomhú a fháil mura bhfuil tú ag gabháil leis na himeachtaí

source: This involves the creditor registering the judgment in the Central Office of the High Court
ga: Cuimsíonn sé seo an creidiúnaí ag clárú an bhreithiúnais i bPríomh-Oifig na hArd-Chúirte

source: Judgments from the District Court, the Circuit Court and the High Court may all be registered
ga: Is féidir le breithiúnais ón gCúirt Dúiche, ón gCúirt Chuarda agus ón Ard-Chúirt ar fad a bheith cláirithe

source: Registering the judgment does not directly enforce the judgment
ga: Ní chuireann clárú an bhreithiúnais an breithiúnas i bhfeidhm ar bhealach díreach

source: It does, however, publicise the fact that there is a judgment against you and, as a result, means that you are unlikely to be able to borrow further
ga: Poiblíonn sé, áfach, go bhfuil breithiúnas i do choinne agus, mar thoradh air sin, ciallaíonn sé nach dócha go bhfuil tú le bheith in ann tuilleadh a fháil ar iasacht

source: Lists of judgments are published by credit reference agencies (for example, in Stubbs Gazette and some newspapers)
ga: Tá liostaí na mbreithiúnas foilsithe ag gníomhaireachtaí teistiméireachta creidmheasa (mar shampla, i Stubbs Gazette agus roinnt nuachtáin)

source: Before registering a judgment, the creditor must tell you that it is intended to register and give you an opportunity to pay the debt
ga: Roimh bhreithiúnas a chlárú, ní mór don chreidiúnaí a insint duit go bhfuil sé i gceist é a chlárú agus deis a thabhairt duit an fiacha íoc

source: The following are the main ways of enforcing judgments:
ga: Seo a leanas na príomhbhealaí breithiúnais a fhorfheidhmiú:

source: • Instalment orders, followed (if necessary) by committal orders
ga: • Orduithe tráthchoda, leanta (más gá) ag orduithe cimithe

source: • Judgment mortgage (see more in our document on home repossession)
ga: • Morgáiste breithiúnais (féach ar ár gcáipéis ar athshealbhú baile)

source: Other ways of enforcing judgments include attachment of debts, appointment of a receiver and bankruptcy proceedings, but these are rarely used for consumer debts
ga: Bealaí eile ata ar fáil ná astú fiacha, glacadóir a cheapadh nó imeachtaí féimheachta, ach is annamh a úsáidtear iad seo i leith fiacha tomhaltóirí

source: They are briefly outlined in ‘Other methods of enforcing judgments’ below
ga: Tá curs síos gairid ar na roghanna seo i 'Bealaí eile forfheidhmithe' thíos

source: Execution against goods is one of the main ways of enforcing a judgment
ga: Tá forghníomhú in aghaidh earraí ar cheann de na príomhbhealaí chun breithiúnas a fhorfheidhmiú

source: It is sometimes called distress against goods
ga: Uaireanta tugtar anacair in aghaidh earraí air

source: It means that the creditor gets an order from the court which directs the Sheriff or County Registrar to seize your goods and sell them in order to raise the amount of money which you owe plus costs
ga: Is éard is brí leis ná go bhfaigheann an creidiúnaí ordú ón gcúirt a ordaíonn an Sirriam nó an Cláraitheoir Contae do chuid earraí a ghabháil agus iad a dhíol chun an méid airgid atá dlite agat a ardú chomh maith le costais

source: • In the case of a High Court judgment, the order directing the seizure of your goods is known as an order of fieri facias or fifa
ga: • I gcás breithiúnas Ard-Chúirte, tugtar ordú fieri facias nó fifa ar an ordú ag stiúradh urghabháil do chuid earraí

source: • In the case of a Circuit Court judgment, the order is known as an execution order against goods
ga: • I gcás breithiúnas Cúirte Cuarda, tugtar ordú i gcoinne earraí forghníomhaithe ar an ordú

source: • In the case of the enforcement of a District Court judgment, the court’s judgment or decree itself is sent to the Sheriff or County Registrar for execution
ga: • I gcás fhorghníomhú bhreithiúnas na Cúirte Dúiche, seoltar breithiúnas na cúirte nó an fhoraithne é féin chuig an Sirriam nó chuig an gCláraitheoir Contae le forghníomhú

source: Sheriffs and County Registrars
ga: Sirriamaí agus Cláraitheoirí Contae

source: Sheriffs enforce judgments in counties Cork and Dublin while County Registrars enforce them in all other places
ga: Forfheidhmíonn Sirriamaí breithiúnais i gcontaetha Chorcaí agus Bhaile Átha Cliath agus forfheidhmíonn Cláraitheoirí Contae iad in áiteanna eile

source: Sheriffs are self-employed people who are paid for their enforcement work on a commission basis
ga: Is daoine féinfhostaithe iad Sirriamaí atá íoctha as a gcuid obair fhorfheidhmithe ar bhonn coimisiúin

source: The system is called 'poundage'
ga: Is córas é ar a dtugtar 'puntáiste'

source: The fees that they get are set out in Statutory Instruments
ga: Tá na táillí a fhaigheann siad leagtha amach in ionstraimí reachtúla

source: The current one is the Sheriff’s Fees and Expenses Order (SI 644/2005) made under the Enforcement of Court Orders Act 1926
ga: Is é Ordú Táillí agus Costais Sirriam (IR644/2005) an ceann reatha, a rinneadh faoin Acht um Fheidhmiú Orduithe Cúirte 1926

source: This provides for various fixed fees and a scale of fees related to the amount involved
ga: Soláthraíonn sé seo táillí socraithe éagsúla agus scála táillí a bhaineann leis an méid atá i gceist

source: This is 5% of the first €5,500 and 2.5% of the balance
ga: Is é seo 5% den chéad €5,500 agus 2.5% den iarmhéid

source: It also provides for the payment of various expenses incurred in the enforcement process
ga: Ina theannta sin, soláthraíonn sé costais éagsúla a íoc a tabhaíodh mar chuid den phróiseas forfheidhmithe

source: County Registrars are civil servants whose main job is to organise the business of the Circuit Court in their areas
ga: Is státseirbhísigh iad Cláraitheoirí Contae a bhfuil eagrú gnó na Cúirte Cuarda mar phríomhphost acu in a gceantair féin

source: (They are also Returning Officers for elections and referendums.)
ga: (Is Cinn Chomhairimh iad freisin le haghaidh toghchán agus reifreann.)

source: As well as County Sheriffs in Cork and Dublin, there are Revenue Sheriffs who enforce debts owed to the Revenue Commissioners
ga: Chomh maith le Sirriamaí Contae i gCorcaigh agus i mBaile Átha Cliath tá Sirriamí Ioncaim a chuireann fiacha atá dlite do na Coimisinéirí Ioncaim i bhfeidhm

source: They have the power to collect tax debts
ga: Tá an chumhacht acu fiacha cánach a bhailiú

source: They can do this on the basis of a certificate of liability issued by the Collector General (the official in the Revenue Commissioners who is responsible for collecting taxes) and do not need a court order
ga: Is féidir leo é seo a dhéanamh trí theastas fiachais eisithe ag an Ard-Bhailitheoir (an t-oifigeach sna Coimisinéirí Ioncaim atá freagrach as bailiú cánacha) agus ní gá ordú cúirte a bheith acu

source: Revenue debts can also be collected in the normal way if there is a court order
ga: Is féidir fiacha ioncaim a bhailiú freisin ar an ngnáthbhealach má tá ordú cúirte ann

source: The Sheriff or County Registrar does not have to give notice of intention to seize your property or goods in order to execute a judgment
ga: Ní chaithfidh an Sirriam nó an Cláraitheoir Contae fógra a thabhairt go bhfuiltear chun do mhaoin nó do chuid earraí a urghabháil chun breithiúnas a fhorghníomhú

source: Their duty is to the creditor, so they cannot take your circumstances into account
ga: Luíonn dualgas an tSirriam/Chláraitheoir a Contae leis an gcreidiúnaí agus ní féidir leo do chúinsí a thógáil san áireamh

source: Revenue Sheriffs have specific powers to make an instalment arrangement with you
ga: Tá cumhachtaí sonracha ag Sirriam Ioncaim socrú tráthchoda a dhéanamh leat

source: The creditor may apply to court to have you examined about your assets so that it can be established what assets you have that are available for the execution of the judgment
ga: Féadfaidh an creidiúnaí iarratas a dhéanamh ar an gcúirt scrúdú a dhéanamh ort i leith do shócmhainní ionas gur féidir a bhunú céard iad na sócmhainní atá agat atá ar fáil le haghaidh fheidhmiú an bhreithiúnais

source: The Sheriff/County Registrar has the power to go onto your property in order to seize your goods
ga: Tá an chumhacht ag Sirriamaí/Cláraitheoirí Contae dul ar do réadmhaoin chun do chuid earraí a ghabháil

source: They must make reasonable efforts to do this peaceably and without violence but they may make a forced entry
ga: Caithfidh siad iarrachtaí réasúnta a dhéanamh é seo a dhéanamh go síochánta gan fhoréigean ach is féidir leo iontráil go fórsúil

source: The law provides that the Sheriff/County Registrar may not seize certain goods but this is effectively meaningless because of the amounts allowed
ga: Forálann an dlí nach féidir le Sirriamaí/Cláraitheoirí Contae earraí áirithe a ghabháil ach tá sé seo gan bhrí éifeachtach mar gheall ar na méideanna a cheadaítear

source: They may not seize your necessary clothes and bedding and the tools of your trade provided the value of such necessities is not more than €19
ga: Ní féidir leo do chuid éadaí agus leabú riachtanacha a ghabháil ná uirlisí do thrádála ar choinníoll nach bhfuil luach na n-earraí riachtanacha seo níos mó ná €19

source: In practice, goods with a low resale value are unlikely to be seized
ga: I gcleachtas, ní dócha go ngabhtar earraí le luach athdhíolta íseal

source: The Sheriff/County Registrar must account to the court for the goods seized
ga: Caithfidh na Sirriamaí/CláraitheoiríContae cuntas a thabhairt don chúirt a shainmhíníonn na hearraí gabhta

source: If no goods are found, they make a return of nulla bona, literally meaning "no goods"
ga: Más rud é nach bhfaightear earra ar bith, déanann siad 'nulla bona' a aischur, a chiallaíonn, go litriúil, earraí ar bith

source: If the Sheriff/County Registrar does seize your goods, they must, within 24 hours, give you an itemised and signed list of the goods seized
ga: Má dhéanann Sirriamaí/CláraitheoiríContae do chuid earraí a ghabháil, caithfidh siad, laistigh de 24 uair an chloig, liosta mionsonraithe agus sínithe na n-earraí a ghabhadh a thabhairt duit

source: They may then sell the goods by public auction – this can happen at any time from 2 days after the seizures
ga: Féadfaidh siad na hearraí a dhíol ansin trí cheant poiblí – d’fhéadfadh sé seo tarlú ag am ar bith ó dhá lá tar éis na ngabhálacha

source: In practice, you are usually given warning of the impending sale
ga: I gcleachtas, tugtar rabhadh duit faoin díolatá i ngar, de ghnáth

source: The instalment order procedure is mainly used by small creditors such as shops and credit unions
ga: Úsáidtear nós imeachta an ordú tráthchoda go príomha ag creidiúnaithe ar nós siopaí agus comhair chreidmheasa

source: It can be used for judgments given in the District, Circuit or High Court
ga: Is féidir é a úsáid le haghaidh breithiúnais a tugadh sa Chúirt Dúiche, sa Chúirt Chuarda nó san Ard-Chúirt

source: It is also used by creditors in family law proceedings, mainly for the enforcement of maintenance orders
ga: Úsáideann creidiúnaithe é freisin in imeachtaí dlí teaghlaigh, go príomha le haghaidh fhorfheidhmiú na n-orduithe cothabhála

source: If you are a family law debtor - for example, if you have a maintenance order against you which has not been met - your creditor can get an attachment of earnings order
ga: Más creidiúnaí dlí teaghlaigh thú, mar shampla, má tá ordú cothabhála agat i do choinne nach bhfuil comhlíonta go fóill, is féidir do chreidiúnaí ordú um astú tuillimh a fháil

source: Instalment orders are governed by the Enforcement of Court Orders Acts 1926 - 2009 and Order 53 of the District Court Rules
ga: Tá orduithe tráthchoda faoi rialú ag na hAchtanna um Fheidhmiú Orduithe Cúirte 1926 - 2009 agus ag Ordú 53 de Rialacha na Cúirte Dúiche

source: Your creditor can apply to the District Court in the district in which you live to have you attend the court in order to establish your means
ga: Is féidir le do chreidiúnaí iarratas a dhéanamh ar an gCúirt Dúiche sa dúiche ina bhfuil cónaí ort ag iarraidh ort freastal ar an gcúirt d’fhonn d'acmhainní a bhunú

source: The judge may then order payment in full or payment in instalments, taking account of your means
ga: Féadfaidh an breitheamh íocaíocht iomlán nó íocaíocht i dtráthchodanna a ordú, ag tógáil d'acmhainní san áireamh

source: Failure to meet instalment order
ga: Loiceadh ordú tráthchoda a chomhlíonadh

source: If you fail to meet the instalment order, the creditor may look for a committal order which would commit you to prison
ga: Má theipeann ort an t-ordú tráthchoda a chomhlíonadh, féadfaidh an creidiúnaí ordú cimithe a lorg a chuirfeadh chun príosúin thú

source: Upcoming changes: The Civil Debt (Procedures) Act 2015 provides for abolition of the imprisonment of debtors for non-payment of civil debts
ga: Athruithe: Forálann an tAcht um Fhiachas Sibhialta (Nósanna Imeachta), 2015 deireadh a chur le féichiúnaithe a chur i bpriosún

source: This is due to come into effect shortly
ga: Tá sé le teacht i bhfeidhm go luath

source: The Enforcement of Court Orders (Amendment) Act 2009 sets out the procedure for committal orders
ga: Leagann an tAcht um Fhorfheidhmiú Orduithe Cúirte (Leasú) 2009 amach an nós imeachta le haghaidh orduithe cimithe

source: This effectively provides that you may be imprisoned for failure to pay debts only if you can afford to pay but refuse to do so
ga: Soláthraíonn sé seo gur féidir thú a chur i bpríosún má theipeann ort fiacha a íoc sa chás go bhfuil sé d’acmhainn agat íoc astu ach diúltaíonn tú é a dhéanamh

source: The process involves a summons to appear at the District Court
ga: Baineann toghairm le bheith i láthair ag an gCúirt Dúiche leis an bpróiseas

source: This is issued by the District Court clerk at the request of the creditor
ga: Tá sé seo eisithe ag an gcléireach Cúirte Dúiche arna iarraidh ag an gcreidiúnaí

source: The summons must clearly set out:
ga: Caithfidh an toghairm na nithe seo a leanas a leagadh amach go soiléir:

source: • The consequences of a failure to turn up in court, including the possibility of imprisonment
ga: • na hiarmhairtí a bhaineann le loiceadh a bheith sa chúirt, lena n-áirítear an fhéidearthacht phríosúnachta;

source: • The options available to the judge at the hearing
ga: • na roghanna atá ar fáil don bhreitheamh ag an éisteacht;

source: • The possibility that you will be arrested if you fail to turn up in court
ga: • an fhéidearthacht go ngabhfar thú má theipeann ort dul chun na cúirte

source: You are required to prepare a statement of means and lodge this at least a week before the hearing is due to take place
ga: Iarrtar ort ráiteas acmhainne a ullmhú agus é seo a thaisceadh ar a laghad seachtain roimh chur i gcrích na héisteachta

source: If you fail to turn up, without reasonable excuse, a judge can either issue an arrest warrant (this orders the Gardaí to bring you before the court at the earliest opportunity) or adjourn the hearing
ga: Má theipeann ort a bheith i láthair, gan leithscéal réasúnta, is féidir le breitheamh barántas gabhála a eisiúint (ordaíonn sé seo na Gardaí thú a thabhairt os comhair na cúirte chomh luath agus is féidir) nó an éisteacht a chur ar athló

source: If you are arrested and brought to court, a date is fixed for the hearing
ga: Má ghabhtar thú agus má thugtar chun na cúirte thú, socraítear dáta don éisteacht

source: The judge must make clear to you, in ordinary language:
ga: Ní mór don bhreitheamh a chur in iúl duit go soiléir, i ngnáthchaint,

source: • That you are entitled to apply for legal aid and
ga: • go bhfuil tú i dteideal iarratas a dhéanamh ar chúnamh dlíthiúil agus

source: • The consequences, including imprisonment, of failing to comply with the instalment order or of failing to appear for the hearing on the date fixed
ga: • na hiarmhairtí, lena n-áirítear príosúnacht, a bhaineann le loiceadh géilleadh leis an ordú tráthchoda nó loiceadh a bheith i láthair don éisteacht ar an dáta socraithe

source: At the hearing, both you and the creditor may give evidence
ga: Ag an éisteacht, féadfaidh tú féin agus an creidiúnaí fianaise a thabhairt

source: The court has a number of options
ga: Tá roinnt roghanna ag an gcúirt

source: It may vary the instalment order
ga: Féadfaidh sí an t-ordú tráthchoda a athrú

source: Alternatively, the court may ask you to engage in mediation
ga: Mar mhalairt air sin, féadfaidh an chúirt iarraidh ort dul i mbun idirghabhála

source: The Money Advice and Budgeting Service (MABS) may be used for such mediation
ga: Is féidir MABS a úsáid le haghaidh idirghabhála den chinéal sin

source: The third option is to make a committal order (for a maximum of 3 months)
ga: Is é an tríú rogha ordú cimithe a dhéanamh (ar feadh uasmhéid de thrí mhí)

source: This can come into effect immediately or at a later date
ga: Is féidir leis seo teacht i bhfeidhm láithreach nó ag dáta níos déanaí

source: A committal order is an order to the Gardaí for your arrest and imprisonment
ga: Is ordú cimithe é ordú chuig na Gardaí thú a ghabháil agus a phríosúnú

source: The creditor is obliged to establish, beyond reasonable doubt, that you have means but you are wilfully refusing to pay
ga: Tá oibleagáid ar an gcreidiúnaí a bhunú, thar aon amhras réasúnta, go bhfuil acmhainní agat ach go bhfuil tú ag diúltú a íoc go toiliúil

source: The court has the power to grant you legal aid in accordance with the rules governing the criminal legal aid scheme
ga: Tá an chumhacht ag an gcúirt cúnamh dlíthiúil a bhronnadh ort i gcomhréir leis na rialacha a rialaíonn an scéim um chúnamh dlíthiúil coiriúil

source: At present, attachment of earnings is used only for orders of maintenance of spouses and children
ga: Faoi láthair, níl astú tuillimh ar fáil ach amháin chun cothabháil a íoc do chéilí agus leanaí

source: The Civil Debt (Procedures) Act 2015 provides for the attachment of earnings or deductions from social welfare payments, as appropriate, for the purpose of the enforcement of debts
ga: Forálann an tAcht um Fhiachas Sibhialta (Nósanna Imeachta), 2015 go leathnófar scóp an rogha seo

source: The creditor may register a charge against property owned by you
ga: Is féidir leis an gcreidiúnaí morgáiste breithiúnais a chlárú i do choinne

source: The effect is the same as taking out a conventional mortgage
ga: Tá an éifeacht chéanna ag morgáiste breithiúnais go forleathan le morgáiste gnásúil

source: You have to pay off the judgment mortgage when the property is sold
ga: Caithfidh tú í a íoc nuair a dhíolann tú an teach

source: Read more in our document on home repossession
ga: Faigh tuilleadh eolais inár gcáipéis ar athshealbhú baile

source: If you owe money to a creditor and another person owes money to you, then your creditor can get an order which attaches the debt owed to you by the other person
ga: Má tá airgead ag dul do chreidiúnaí uait agus tá airgead ag dul duit ó dhuine eile, ansin is féidir le do chreidiúnaí ordú a fháil a cheanglaíonn an fiach atá dlite duit ag an duine eile dó

source: This is known as a garnishee order
ga: Tugtar ordú gairnisí air seo

source: Generally, it is used only in cases where there are no goods to be seized to satisfy the judgment
ga: Go ginearálta, úsáidtear é ach amháin nuair nach bhfuil aon earraí le gabhadh chun an breithiúnas a shásamh

source: It is relatively rarely used in cases of consumer debt
ga: Tá sé sách annamh a úsáidtear é i gcásanna fhiachas tomhaltóra

source: The Revenue Commissioners have specific powers of attachment which can be exercised without a court order
ga: Tá cumhachtaí astú féich ar leith ag na Coimisinéirí Ioncaim agus is féidir iad a fheidhmiú gan ordú cúirte

source: A receiver may be appointed over some of your assets or over future income such as rents, income of a trust fund or a pension
ga: Is féidir le glacadóir a bheith ceaptha thar roinnt de do shócmhainní nó thar ioncam sa todhchaí mar chíos, ioncam ó chiste iontaobhais nó pinsean

source: The law in this area is complex but it seems that a receiver cannot be appointed over future earnings
ga: Tá an dlí sa réimse seo casta ach is cosúil nach féidir le glacadóir a bheith ceaptha thar thuilleamh sa todhchaí
